<a href="https://colab.research.google.com/github/jyotirmoy204/analyzing-movie-dataset/blob/main/TitanicDataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**TITANIC SURVIVOR ANALYSIS**

---


In this project I am going to analyse the Titanic dataset and classify passenger to find out whether they will survive or not.

---

---

Reading Data from CSV using pandas and DataFrame

In [7]:
import pandas as pd
import numpy as np

df=pd.DataFrame(pd.read_csv('train.csv'))
df.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

Shape od the Data(Colums and rows)

In [8]:
df.shape

(891, 12)

Handeling Null Values

In [9]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

IT can be seen that there are two columns which have Null values, so we need to wither delete those rows or fill them up with the mean (if it is integer) or with the most frequent character if it is string.

---

---

---

Now I will store only those columns which provide more than 35% of data missing.These columns will be dropped from the DataFrame.

In [10]:
drop_col=df.isnull().sum()[df.isnull().sum()>(35/100*df.shape[0])]
drop_col

Cabin    687
dtype: int64

Now I  will drop the Cabin column as it has more than 35% of values missing, so it will not provide any detailed information in the analysis.

In [11]:
df.drop('Cabin',axis=1,inplace=True)
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

Now I will fill the Null values with the mean and frequent characters.

In [12]:
df.fillna(df.mean(),inplace=True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

The Age column is filled with the mean age of the column.Now I will fill the Embarked column with the most repeated character.

In [13]:
df['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

So I can see that the most repeated character in Embarked column is S.So I will fill it with S.

In [14]:
df['Embarked'].fillna('S',inplace=True)
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

Now that the data is cleaned I can use it for Analysis.

In [15]:
df.corr()#shows the correlation of each column with each other

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]

sibsp:Number of Siblings/Spouse Aboard

parch:Number of Parents /Children Aboard

So I can make a new column family_size by combining these two rows and remove these two rows

In [17]:
df['FamilySize']=df['SibSp']+df['Parch']
df.drop(['SibSp','Parch'], axis=1,inplace=True)
df.corr()

             PassengerId  Survived    Pclass       Age      Fare  FamilySize
PassengerId     1.000000 -0.005007 -0.035144  0.033207  0.012658   -0.040143
Survived       -0.005007  1.000000 -0.338481 -0.069809  0.257307    0.016639
Pclass         -0.035144 -0.338481  1.000000 -0.331339 -0.549500    0.065997
Age             0.033207 -0.069809 -0.331339  1.000000  0.091566   -0.248512
Fare            0.012658  0.257307 -0.549500  0.091566  1.000000    0.217138
FamilySize     -0.040143  0.016639  0.065997 -0.248512  0.217138    1.000000

FamilySize in the ship does not have much correlance with survival rate

Lets check if whether the person was alone or not can affect the survival rate.

In [22]:
df['Alone']=[0 if df['FamilySize'][i]>0 else 1 for i in df.index]
df.head()

   PassengerId  Survived  Pclass  ... FamilySize ALone  Alone
0            1         0       3  ...          1     0      0
1            2         1       1  ...          1     0      0
2            3         1       3  ...          0     1      1
3            4         1       1  ...          1     0      0
4            5         0       3  ...          0     1      1

[5 rows x 12 columns]

In [23]:
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

so, if the person is alone he/she has less chance of surviving

The reason might be the person travelling with his family might be belonging to rich class and might be prioritized over other.

In [24]:
df[['Alone','Fare']].corr()

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

So, I can see that if the person was not alone , the chance the ticket price is high is higher.

In [25]:
df['Sex']=[0 if df['Sex'][i]=='male'else 1 for i in df.index]
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

It shows that female passengers have more chance of surviving than the male ones.
It shows women were prioritized over men.

In [26]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.339009
Name: Survived, dtype: float64

**Conclusion :**


*   female passengers were prioritized over men
*   People with high class or rich people have higher survival rate than others.  The hierarchacy have been followed while saving the passwengers.
*   Passengers travelling with their family have higher survival rate.
*   Passengers who boarded the ship at Cherbough, survived more in proportions than the others.